mq7k/Nex/appstack/synapse/include/synapse/stm32/system/chips/f4/rm/rm0090.h
#ifndef STM32_RM0090_H
#define STM32_RM0090_H

#define STM32_RTC_EXTENDED
#define STM32_RTC_TAFCR_REG
#define STM32_RTC_ALARMB
#define STM32_RTC_BKP_WORDS (76)
#define STM32_RTC_COARSE_DIGITAL_CALIB
#define STM32_RTC_TAMPER2
#define STM32_RTC_TAMPER1_MAPPING
#define STM32_RTC_ALARM_TYPE

#define STM32_ADC_AWDCH17
#define STM32_ADC_AWDCH18
#define STM32_ADC_CSR_REG
#define STM32_ADC_COM_MULTI_MODE
#define STM32_ADC_COM_DELAY
#define STM32_ADC_COM_DMA
#define STM32_ADC_CDR_REG

#define STM32_GPIO_SPEED_HIGH
#define STM32_GPIO_SPEED_VERY_HIGH

#define STM32_RCC_AHB2
#define STM32_RCC_AHB2_REG
#define STM32_RCC_AHB3
#define STM32_RCC_SAI1A
#define STM32_RCC_SAI1A_SRC_LAYOUT2
#define STM32_RCC_SAI1B
#define STM32_RCC_SAI1BSRC_LAYOUT2
#define STM32_RCC_RNG_AHB2
#define STM32_RCC_PLLI2S
#define STM32_RCC_PLLI2S_FACTORR
#define STM32_RCC_PLLSAI
#define STM32_RCC_PLLSAI_FACTORR
#define STM32_RCC_PLLI2S_DIVQ
#define STM32_RCC_PLLSAI_DIVR
#define STM32_RCC_SAI1ASRC_LAYOUT2

#define STM32_TIM_CC4NP

#define STM32_SYSCFG_CMPCR
#define STM32_SYSCFG_FMC
#define STM32_SYSCFG_PMC_MII_RMII

#define STM32_LTDC_V1

#define STM32_DCMI_V1

#define STM32_DMA_CHSEL_3BIT

#define STM32_EXTI_ALLOWED_LINES_BITMASK (0x7fffff)

#define STM32_DAC_V1
#define STM32_DAC_CHANNEL2
#define STM32_DAC_CHANNEL_COMMON
#define STM32_DAC_TSEL_EXTENDED

#define STM32_RNG_V1

#if defined(STM32F405xx) || defined(STM32F407xx) ||\
    defined(STM32F415xx) || defined(STM32F417xx)

#define STM32_PWR_VOS_1BIT

#define STM32_SYSCFG_MEMMODE_2BIT

#define STM32_FLASH_SNB_5BIT

#elif defined(STM32F427xx) || defined(STM32F429xx) ||\
      defined(STM32F437xx) || defined(STM32F439xx)

#define STM32_PWR_UD
#define STM32_PWR_ADC
#define STM32_PWR_VOS_2BIT
#define STM32_PWR_OD
#define STM32_PWR_UD

#define STM32_SYSCFG_FLASH_BANK_MODE
#define STM32_SYSCFG_MEMMODE_3BIT
#define STM32_SYSCFG_FMC_SWAP
#define STM32_SYSCFG_ADCxDC
#define STM32_SYSCFG_ADC1DC
#define STM32_SYSCFG_ADC2DC
#define STM32_SYSCFG_ADC3DC
#define STM32_SYSCFG_PMC_MII_RMII

#define STM32_DMA2D_V1

#define STM32_I2C_FILTER

#define STM32_FLASH_PCROP
#define STM32_FLASH_SNB_4BIT

#endif

#if defined(STM32F415xx) || defined(STM32F417xx) ||\
    defined(STM32F437xx) || defined(STM32F439xx)

#define STM32_CRYP_V1

#define STM32_HASH_V1

#endif

#if defined(STM32F437xx) || defined(STM32F439xx)

#define STM32_CRYP_ALGO_EXTENDED
#define STM32_CRYP_CS

#define STM32_HASH_HR_8BYTES
#define STM32_HASH_CSR_REG_COUNT (54)
#define STM32_HASH_ALGO_EXTENDED
#define STM32_HASH_KEY_TYPE

#endif

#if defined(STM32F415xx) || defined(STM32F417xx)

#define STM32_HASH_HR_5BYTES
#define STM32_HASH_CSR_REG_COUNT (51)

#endif

#endif
